/*********************************************************
 求小于1000的自然数中所有3或5的倍数之和。
 ********************************************************/

#include<iostream>
using namespace std;

int main() {
   //循环 
    int sum = 0;
    for(int i = 1; i < 1000; i++){
        if(i % 3 == 0 || i % 5 == 0) {
            sum += i;
        }
    }
    cout << "循环: " << sum << endl;
    //公式
    int sum3 = (3 + 999) * (1000 / 3) / 2;
    int sum5 = (5 + 995) * (999 / 5) / 2;
    int sum15 = (15 + 990) * (999 / 15) / 2;
    cout << "公式: " << sum3 + sum5 - sum15 << endl;
    return 0;
}


