/*************************************************************************
如0.1(6)就是指0.16666...，循环节的长度为1。
可以看出，1/7的循环节长度为6。
在所有满足d<1000的数中，求使得其倒数1/d的
十进制表示中循环节最长的d。
 ************************************************************************/

#include <stdio.h>
#include <string.h>
#define max 1000

//数字x的每位小数
int len(int x){
    int arr[max + 5] = {0};//判断当前余数是否出现过，并计数
    int a = 1, b = 1;//余数,循环节，余数为1时循环节有一个
    arr[1] = 1;
    while(a){
        a *= 10;//扩大10倍再取余，得小数的值，循环节中的值
        a %= x;
        b += 1;
        if(arr[a]) return b - arr[a];//当前步长减a余数出现的位置
        arr[a] = b;//b为第a个余数
    }
    return 0;
}

int main() {
    int d = 0, l = 0;
    for(int i = 2; i < max; i++){
        int a = len(i);//循环节长度
        if(a <= l) continue;
        l = a;
        d = i;
    }
    printf("d = %d  l = %d\n", d, l);
    return 0;
}

