/*************************************************************************
1001*1001以同样方式构成的螺旋数阵，其对角线上的数之和是多少？
 ************************************************************************/

#include<iostream>
using namespace std;
#define max 1001
//每一圈右上角的值为奇数的平方
int main() {
    int n = 1;
    long sum = 0;
    //每一圈都是奇数求平方
    for(int i = 3; i <= max; i += 2){
        sum += i * i * 4 + 6 - 6 * i;
    }
    cout << sum + 1 << endl;
    return 0;
}

/*  21 22 23 24 25
 *  20  7  8  9 10
 *  19  6  1  2 11
 *  18  5  4  3 12
 *  17 16 15 14 13
*/
