/*************************************************************************
 求前一百个自然数的平方的与和平方之差。
 ************************************************************************/

#include<iostream>
#include<algorithm>
using namespace std;

int main() {
    //和平方
    int n = (1 + 100) * 100 / 2;
    int m = 0;
    for(int i = 1; i <= 100; i++){
        m += i * i;
    }
    cout << "循环: " << n * n - m << endl;
    //平方和公式
    int x = 100, m1;
    m1 = x * (x + 1) * (2 * x + 1) / 6;
    cout << "公式: " << n * n - m1 << endl;
    return 0;
}

