/*************************************************************************
 求这1000个位数中连续十三个数字的最大乘积
 ************************************************************************/

#include<iostream>
#include "e8.h"
#define N 1000
using namespace std;
//滑动数组法
int main() {
    long long p = 1, n = 0, m = 0;
    //p,计算乘积; n,记录0的个数; m,最大乘积
    for(int i = 0; num[i]; i++){
        if(num[i] == '0') n += 1;
        else p *= num[i] - '0';//不为0时进行计算
        if(i >= 13){//数组控制在13位
            if(num[i - 13] == '0') n -= 1;//重新由0位置计算
            else p /= num[i - 13] - '0';//多乘了数除去最前一个数
        }
        if(n == 0 && p > m) m = p;
    }
    cout << m << endl;
    return 0;
}


