/*************************************************************************
	> File Name: 119.c
	> Author: 
	> Mail: 
	> Created Time: Sat 30 Sep 2023 09:12:01 PM CST
 ************************************************************************/

//昨天和明天
#include<stdio.h>
  
//在下方实现前一天函数

void yesterday(int *y, int *m, int *d) {
    if(*m == 3 && *d == 1) {
        if(((*y) % 4 == 0 && (*y) % 100 != 0) || (*y) % 400 == 0) {
            (*m) -= 1;
            *d = 29;
        }
        else {
            (*m) -= 1;
            *d = 28;
        }
    }
    else if(*m == 1 && *d == 1) {
        (*y) -= 1;
        *m = 12;
        *d = 31;
    }
    else if((*m == 5 || *m == 7 || *m == 10 || *m == 12) && *d == 1) {
        (*m) -= 1;
        *d == 30;
    }
    else if((*m == 2 || *m == 4 || *m == 6 || *m == 8 || *m == 9 || *m == 11) && *d == 1) {
        (*m) -= 1;
        *d = 31;
    }
    else (*d) -= 1;
    return ;
}

//在下方实现后一天函数
void torrow(int *y, int *m, int *d) {
 
    if(*m == 2) {
        if(((*y) % 4 == 0 && (*y) % 100 != 0) || (*y) % 400 == 0) { 
            if(*d == 29) {
                (*m) += 1;
                *d = 1;
            }
            else (*d) += 1;
        }
        else {
            if(*d == 28) {
                (*m) += 1;
                *d = 1;
            }
            else (*d) += 1;
        }
    }
    else if((*m == 4 || *m == 6 || *m == 9 || *m == 11) && *d == 30) {
        (*m) += 1;
        *d = 1;
    }
    else if((*m == 1 || *m == 3 || *m == 5 || *m == 7 || *m == 8 || *m == 10) && *d == 31){
        *d = 1;
        (*m) += 1;
    }
    else if(*m == 12 && *d == 31) {
        (*y) += 1;
        *m = 1;
        *d = 1;
    }
    else (*d) += 1;
    
    return ; 
}


int main() {
    int y, m, d;

    scanf("%d%d%d", &y, &m, &d);
    //在下方调用前一天函数
    yesterday(&y, &m, &d);
  
    printf("%d %d %d\n", y, m, d);
    
    //在下方调用后一天函数
    //scanf("%d%d%d", &y, &m, &d);
    torrow(&y, &m, &d);
    torrow(&y, &m, &d);
    printf("%d %d %d\n", y, m, d);
    return 0;
}


