/*************************************************************************
	> File Name: 153.c
	> Author: 
	> Mail: 
	> Created Time: Fri 20 Oct 2023 09:46:05 PM CST
 ************************************************************************/

//某天是周几,
#include <stdio.h>

int main() {
    int y, m, d, h;
    scanf("%d%d%d", &y, &m, &d);
    if(m == 1 || m == 2) {
        m = m + 12;
        y -= 1;
    }
    int j = y / 100, k = y % 100;
    h = (d + 26 * (m + 1) / 10 + k + k / 4 + j / 4 + 5 * j) % 7;
    
    if(h == 0 || h == 1) h = h + 6;
    else h -= 1;
    printf("%d\n", h);

    return 0;
}



